In [4]:
import sqlite3

In [3]:
db = sqlite3.connect('IMDB.sqlite')
db

In [19]:
db = sqlite3.connect('room.sqlite')
db

In [20]:
cur = db.cursor()
cur

In [21]:
sql_query = 'Create table room(rollnumber int primary key, name text, age int)'
cur.execute(sql_query)

In [22]:
cur.execute('Insert into room values(1012,"siddhu",24)')

In [23]:
db.commit()

In [37]:
db = sqlite3.connect('Employee.sqlite')
db

In [38]:
cur = db.cursor()
cur

In [29]:
a = 'Create table employee(employeeid int primary key, name text , age int , department text, salary text)'
cur.execute(a)

In [31]:
b = 'Insert into employee values(100,"Rishav",25,"Marketing",50000), (101,"abhishek", 26, "Operations", 600000),(102,"Aman",24, "Human Resource", 75000)'
cur.execute(b)

In [32]:
db.commit()

In [7]:
idd = 103
name = "siddhu"
ag   = 19
dep = "testing"
salary = 1000
cur.execute('Insert into employee values(?,?,?,?,?)',(idd,name,ag,dep,salary))

In [9]:
db.commit()

In [10]:
cur.execute('Update employee set salary = 1000000 where name = "siddhu"')

In [11]:
db.commit()

In [13]:
db.execute('delete from employee where employeeid = 101')

In [14]:
db.commit()

In [17]:
emid = 102
db.execute('delete from employee where employeeid = ?',(emid,))

In [18]:
db.commit()

In [20]:
db.execute('delete from employee where employeeid = 103')
db.execute('delete from employee where employeeid = 104')

In [26]:
db.execute('delete from employee')

In [27]:
db.commit()

In [28]:
## Open and read data file as specified in the question
## Print the required output in given format
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]
for i in range(len(name))
    db.execute('insert into employee values(?,?,?,?,?)',(employee_id[i],name[i],age[i],department[i],salary[i]))
    db.commit()
print('done')

done

In [34]:
db = sqlite3.connect('school.sqlite')
cur = db.cursor()

In [39]:
cur.execute('Select * from employee')

In [40]:
for i in cur:
    print(i)

(101, 'Aadarsh', 25, 'Marketing', '50000')
(102, 'Aarti', 27, 'Operations', '60000')
(103, 'Siddharth', 25, 'Finance', '85000')
(104, 'Aman', 24, 'Human Resource', '75000')
(105, 'Amit', 30, 'Marketing', '50000')
(106, 'Shivansh', 26, 'IT', '90000')
(107, 'Vaibhav', 23, 'Finance', '85000')
(108, 'Himanshu', 26, 'IT', '90000')
(109, 'Raman', 25, 'Operations', '60000')
(110, 'Kunal', 26, 'Marketing', '50000')
(111, 'Adhira', 29, 'Human Resource', '75000')
(112, 'Tanya', 24, 'Marketing', '50000')

In [41]:
cur.execute('select * from employee')
print(cur.fetchone())

(101, 'Aadarsh', 25, 'Marketing', '50000')

In [42]:
print(cur.fetchmany(3))#default value is 1

[(102, 'Aarti', 27, 'Operations', '60000'), (103, 'Siddharth', 25, 'Finance', '85000'), (104, 'Aman', 24, 'Human Resource', '75000')]

In [43]:
print(cur.fetchall())

[(105, 'Amit', 30, 'Marketing', '50000'), (106, 'Shivansh', 26, 'IT', '90000'), (107, 'Vaibhav', 23, 'Finance', '85000'), (108, 'Himanshu', 26, 'IT', '90000'), (109, 'Raman', 25, 'Operations', '60000'), (110, 'Kunal', 26, 'Marketing', '50000'), (111, 'Adhira', 29, 'Human Resource', '75000'), (112, 'Tanya', 24, 'Marketing', '50000')]

In [44]:
cur.execute('select * from employee where employeeid >105')

In [45]:
print(cur.fetchall())

[(106, 'Shivansh', 26, 'IT', '90000'), (107, 'Vaibhav', 23, 'Finance', '85000'), (108, 'Himanshu', 26, 'IT', '90000'), (109, 'Raman', 25, 'Operations', '60000'), (110, 'Kunal', 26, 'Marketing', '50000'), (111, 'Adhira', 29, 'Human Resource', '75000'), (112, 'Tanya', 24, 'Marketing', '50000')]

In [52]:
cur.execute('select count(*) from employee where department = "IT"')
print(cur.fetchall())

[(2,)]

# SQLite x PANDAS

In [3]:
import pandas as pd
import sqlite3 as sql
db = sql.connect('employee.sqlite')
data = pd.read_sql_query("SELECT * FROM employee",db)

In [11]:
data.to_sql("emplooyee",db)

2

In [6]:
data[data['age'] == 25]

   employeeid       name  age  department salary
0         101    Aadarsh   25   Marketing  50000
2         103  Siddharth   25     Finance  85000
8         109      Raman   25  Operations  60000

In [9]:
data = pd.DataFrame([[201,"kunal", 20, "IT",1000000],[202, "srijan", 20,"IT", 100000]])

In [17]:
data = pd.read_sql_query("select * from employee",db)
data["address"] = "test"
data

    employeeid       name  age      department salary address
0          101    Aadarsh   25       Marketing  50000    test
1          102      Aarti   27      Operations  60000    test
2          103  Siddharth   25         Finance  85000    test
3          104       Aman   24  Human Resource  75000    test
4          105       Amit   30       Marketing  50000    test
5          106   Shivansh   26              IT  90000    test
6          107    Vaibhav   23         Finance  85000    test
7          108   Himanshu   26              IT  90000    test
8          109      Raman   25      Operations  60000    test
9          110      Kunal   26       Marketing  50000    test
10         111     Adhira   29  Human Resource  75000    test
11         112      Tanya   24       Marketing  50000    test

In [27]:
db.to_sql("employee",db)

AttributeError: 'sqlite3.Connection' object has no attribute 'to_sql'

In [2]:
import sqlite3 as sql
import pandas as pd
db = sql.connect('resource/IMDB.sqlite')

In [28]:
data = pd.read_sql_query("select * from IMDB", db)
curr = db.cursor()
# print(data)
maxi = data.TotalVotes.argmax()
print(data.Movie_id[maxi])
query = "select Title, rating from IMDB where movie_id = 46824"
curr.execute(query)
curr.fetchall()

46824

[('Inception\xa0(2010)', 8.8)]

In [26]:
import sqlite3 as sql
import pandas as pd
db = sql.connect('resource/IMDB.sqlite')
curr = db.cursor()
data = pd.read_sql_query("select * from earning", db)
data["earning"] = data.Domestic+ data.Worldwide

maxi = data.earning.argmax()
idd = data.Movie_id[maxi]
print(idd)
query = "select rating from IMDB where Movie_id = 38626"

curr.execute(query)
curr.fetchall()

38626

[(8.1,)]

In [1]:
import sqlite3 as sql
import pandas as pd
db = sql.connect('resource/IMDB.sqlite')
cur = db.cursor()
data = pd.read_sql_query("select * from IMDB ", db)
for i in data.Runtime:
    if len(i) == 0 :
        i = "0 min"
#     print(type(i))
data["length"] = data.Runtime.split()[0]
data.head(10)

AttributeError: 'Series' object has no attribute 'split'

In [4]:
import pandas as pd
import sqlite3

db = sqlite3.connect('resource/IMDB.sqlite')

data = pd.read_sql_query('select * from IMDB',db)
data

,Movie_id,Title,Rating,TotalVotes,MetaCritic,Budget,Runtime,CVotes10,CVotes09,CVotes08,...,Votes3044,Votes3044M,Votes3044F,Votes45A,Votes45AM,Votes45AF,VotesIMDB,Votes1000,VotesUS,VotesnUS
0,36809,12 Years a Slave (2013),8.1,496092,96,20000000.0,134 min,75556,126223,161460,...,8.0,7.9,8.0,7.8,7.8,8.1,8.0,7.7,8.3,8.0
1,30114,127 Hours (2010),7.6,297075,82,18000000.0,94 min,28939,44110,98845,...,7.5,7.5,7.5,7.3,7.3,7.5,7.6,7.0,7.7,7.6
2,37367,50/50 (2011),7.7,283935,72,8000000.0,100 min,28304,47501,99524,...,7.6,7.6,7.6,7.4,7.4,7.5,7.4,7.0,7.9,7.6
3,49473,About Time (2013),7.8,225412,,12000000.0,123 min,38556,43170,70850,...,7.6,7.6,7.7,7.6,7.5,7.8,7.7,6.9,7.8,7.7
4,14867,Amour (2012),7.9,76121,94,8900000.0,127 min,11093,15944,22942,...,7.7,7.7,7.9,7.9,7.8,8.1,6.6,7.2,7.9,7.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
112,38262,Whiplash (2014),8.5,492285,88,3300000.0,107 min,110404,161864,132656,...,8.3,8.3,8.2,8.1,8.1,8.2,8.7,8.0,8.6,8.4
113,10023,Wreck-It Ralph (2012),7.7,295125,72,165000000.0,,41980,50262,96477,...,7.6,7.6,7.7,7.4,7.4,7.5,7.4,7.2,7.9,7.6
114,27783,X-Men: Days of Future Past (2014),8.0,560736,74,200000000.0,132 min,91765,127521,183578,...,7.8,7.8,8.0,7.7,7.7,7.9,7.5,7.4,8.1,7.9
115,42294,X-Men: First Class (2011),7.8,556713,65,160000000.0,132 min,64428,96219,200144,...,7.7,7.6,7.8,7.6,7.5,7.7,7.6,7.3,7.8,7.7
116,32217,Zootopia (2016),8.1,309474,78,150000000.0,108 min,53626,70912,102352,...,7.8,7.8,8.1,7.8,7.8,8.1,7.7,7.6,8.0,8.0